semestre_i/aoc/t2/t2.tex
% Created 2018-09-12 Wed 17:17
% Intended LaTeX compiler: pdflatex
\documentclass[11pt]{article}
\usepackage[utf8]{inputenc}
\usepackage[T1]{fontenc}
\usepackage{graphicx}
\usepackage{grffile}
\usepackage{longtable}
\usepackage{wrapfig}
\usepackage{rotating}
\usepackage[normalem]{ulem}
\usepackage{amsmath}
\usepackage{textcomp}
\usepackage{amssymb}
\usepackage{capt-of}
\usepackage{hyperref}
\input{structure.tex}
\usepackage[portuguese, ]{babel}
\date{\today}
\title{}
\hypersetup{
 pdfauthor={Gustavo de Paula},
 pdftitle={},
 pdfkeywords={},
 pdfsubject={},
 pdfcreator={Emacs 26.1 (Org mode 9.1.14)}, 
 pdflang={Breton}}
\begin{document}

\tableofcontents


\section{Explique o que você entende por memória. Cite dois exemplos de memórias na vida prática (evite usar exemplo de memória de computador).}
\label{sec:org27e9cdb}
Memória é um determinado elemento que é capaz de armazenar itens ísicos ou
abstratos. Exemplos de memórias na vida são:
\begin{itemize}
\item Nosso cérebro.
\item Um galpão
\end{itemize}
\section{Descreva as funções de uma Unidade Central de Processamento.}
\label{sec:orgb89a338}
O papel da unidade central de processamento é realizar todo o ciclo de uma
instrução de máquina. Isso significa poder interpretar e comandar a sequência de
passos para a execução de uma determinada operação e realizar operações
aritméticas e lógicas com dados.
\section{Faça o mesmo para a memória de um computador.}
\label{sec:org76a63db}
\begin{itemize}
\item A memória principal tem o objetivo de armazenamento de dados para utilização
imediata durante a execução de um programa.
\item A memória secundária tem o objetivo de armazenar dados de forma permanente e
para utilizção posterior.
\end{itemize}
\section{Para que servem os dispositivos de entrada e de saída de um computador? Cite alguns exemplos.}
\label{sec:org4ae3ac5}
Para permitir a comunicação entre sistemas computacionais e o mundo externo.
Alguns exemplos são:
\begin{itemize}
\item Mouse
\item Teclado
\item Monitor
\end{itemize}
\section{Imagine uma empresa qualquer. Cite exemplos de arquivos e registros a serem criados para o armazenamento das informações que circulam na tal empresa.}
\label{sec:orge021cb4}
Arquivos:
\begin{itemize}
\item 
\end{itemize}
\section{Conceitue o bit, o byte e a palavra.}
\label{sec:org8ab3a57}
\begin{itemize}
\item Bit: dígito binário (0 ou 1)
\item Byte: conjunto de 8 bits
\item Palavra: conceito usado para especificar um conjunto de bits usado para o
armazenamento e transferência de informções entre MP e UCP.
\end{itemize}
\section{Indique o valor de x nas seguintes expressões:}
\label{sec:orgf6d946b}
\subsection{65.536 = 64K}
\label{sec:orge6912fb}
\subsection{12.288K = 12M}
\label{sec:org8cc839c}
\subsection{19.922.944 = 19M}
\label{sec:orgf5116f2}
\subsection{8 Gbytes = 8.589.934.592 bytes}
\label{sec:org0889a44}
\subsection{64 Kbytes = 524.288 bits}
\label{sec:org55cfa3e}
\subsection{262.144 bits = 256 K bits}
\label{sec:orgf0b29bf}
\subsection{16.777.216 palavras = 16M palavras}
\label{sec:org80725f3}
\subsection{128 Gbits = 137.438.953.472 bits}
\label{sec:orgdd23a5c}
\subsection{512K células = 524.288 células}
\label{sec:org338395f}
\subsection{256 Kbytes = 2M bits}
\label{sec:orgb41b5b3}
\section{O que é vazão em um sistema de computação? E tempo de resposta? Em que circunstâncias são utilizadas estas informações?}
\label{sec:orgae451bd}
Vazão é a quantidade de transações que podem ser executadas por um sistema em
determinado tempo. E.g. quantidade de corridas de motoboy que podem ser alocadas
em um período de 30s.
Tempo de resposta é uma medida que especifica o desempenho do sistema como um
todo e não apenas de alguma partes. E.g. o tempo que leva para uma corrida ser
criada e aparecer na tela de acompanhamento.
\section{Qual é a diferença entre linguagem de alto nível e linguagem de máquina?}
\label{sec:org16e6fc2}
Linguagem de alto nível é uma linguagem de programação mais próxima da linguagem
humana. Já a linguagem de máquina é a linguagem que computadores entendem, se
distanciando muito das regras da linguagem de alto nível.
\section{Se um barramento de endereços possui 17 fios condutores, qual deverá ser o maior endereço que pode ser transportado nesse barramento?}
\label{sec:org9c9f886}
2\(^{\text{17}}\)
\section{Cite exemplos de processadores (UCP) comerciais.}
\label{sec:org7c3181b}
\begin{itemize}
\item AMD Ryzen Threadripper
\item Intel Core i5
\item Qualcomm Snapdragon 830
\end{itemize}
\section{Os barramentos são fios condutores que interligam os componentes de um sistema de computação (Se) e permitem a comunicação entre eles. Eles são organizados em três grupos de fios, cada um deles com funções separadas. Quais são esses grupos? Indique, para cada grupo: sua função, direção do fluxo de sinais e suas principais características.}
\label{sec:orgacfdffd}
\begin{itemize}
\item BD: serve para transportar bits de dados, é bidirecional; suas principais
características são sua largura, velocidade e vazão.
\item BE: serve para transportar bits de endereço; é unidirecional, do processador
para a memória; sua principal característica é a largura.
\item BC: serve para transportar sinais de comunicação e controle; cada fio possui
uma dirção única; sua principal característica é a individualidade de seus
fios.
\end{itemize}
\section{Um determinado Sistema de Computação é constituído de um processador com quatro unidades de cálculo para inteiros, operando a 1,2 GHz de velocidade e de uma Memória Principal (MP) constituída de um espaço máximo de endereçamento de 128M endereços. Ambos os componentes são interligados por um barramento de dados (BD), de endereços (BE) e de controle (BC), sabendo-se que o BC possui 112 fios condutores para seus diversos sinais e que o BD tem uma taxa de transferência de dados de 6,4 Gbits/s. Considerando que o soquete do processador é do tipo 1 para 171 pinos, pergunta-se:}
\label{sec:orga488b5b}
\subsection{Qual deverá ser a velocidade do BD?}
\label{sec:orge55e86b}
Velocidade = Taxa de transferência / Largura ou V = T / L
Largura do BD = Total de pinos - (Pinos do BC + Pinos do BE)
2\(^{\text{(Largura BE)}}\) = 128M = 2\(^{\text{7}}\) * 2\(^{\text{10}}\) * 2\(^{\text{10}}\) = 2\(^{\text{27}}\)
Portanto, Largura do BE = 27
Portanto Largura do BD = 171 - (112 + 27) = 32
Portanto Velocidade = 6,4Gbps / 32 = 200Mbps = 200Mhz
\subsection{O que acontecerá com o sistema se o BE tiver seu projeto alterado, acrescentando-se dois novos fios condutores?}
\label{sec:orgb405df6}
A capacidade de memória será quadruplicada. (x2\(^{\text{2}}\) = 4).
\section{Qual é o princípio fundamental que caracteriza a existência e eficácia dos barramentos em um SC - Sistema de Computação?}
\label{sec:orgeb9caec}

\section{Considere um SC que possua um processador capaz de endereçar, no máximo, 32M posições de memória principal. Qual deverá ser o tamanho, em bits, de seu barramento de endereços (BE)?}
\label{sec:org44421a9}
Deverá ser de 25 bits
\section{Um determinado processador tem seus transistores com espessura de 90 nanômetros. Se se desejasse expressar esta medida em angstroms, como seria indicada a espessura dos transistores? E se a unidade fosse o micron?}
\label{sec:org8238eb1}
90nm = 9 angstrom = 0.09 mi
\section{Calcule o valor de x nas seguintes expressões:}
\label{sec:org6b2c3ca}
\subsection{16K = 2\(^{\text{14}}\)}
\label{sec:org97f8fb5}
\subsection{2\(^{\text{27}}\)= 128M}
\label{sec:orgb652a0d}
\subsection{4M * 128K = 2\(^{\text{9}}\) G}
\label{sec:org136ab2f}
\subsection{32 Mbytes = 2\(^{\text{8}}\) Mbits}
\label{sec:org583287a}
\section{Por que se menciona que a equivalência 200 MHz = 200 Mbps é aproximada e não exata? E por que a equivalência 8000 Mbps = 8 Gbps também não é exata e sim aproximada?}
\label{sec:org60ec1c2}
No primeiro caso porque 1Mhz = 1000Hz, enquanto 1Mbps = 1024bps. Já no segundo é
porque 1G não é 1000M e sim 1024M.
\section{Cite uma das razões principais pela qual os atuais sistemas de computação possuem uma hierarquia de barramentos interligando os diversos componentes, em vez de utilizar um único conjunto de barramentos, interligando todos os componentes do sistema.}
\label{sec:org46c6a41}
Porque há periéricos com velocidades diferentes. Se houvesse apenas um
barramento, um periérico que possuisse uma velocidade maior teria sua velocidade
desacelerada por um periérico de menor velocidade.
\end{document}
